app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" ORDER BY "customers"."full_name" ASC
---
    def alphabetized
      @customers = Customer.order(:full_name)

SELECT "customers".* FROM "customers" WHERE ("customers"."email_address" = ? OR "customers"."email_address" IS NULL)  [["email_address", ""]]
---
    def missing_email
      @customers = Customer.where(email_address: [nil, ""])